// 📁 config.js
module.exports = {
  serverid: "1349061146929532968",
  PREFIX: "!",
  ADMIN_ROLE_ID: "1341094496124928000",
  LOG_CHANNEL_ID: "905853063384928296",
  TICKET_CATEGORY_ID: "901138221805735957",
  COLOR: "#0099ff",
  ticketTypes: {
    family: true,
    alliance: true,
    report: true,
  },
  ticketCategories: {
    family: "1341094549090471988", // معرف فئة تذاكر العائلة
    alliance: "1341094549090471988", // معرف فئة تذاكر التحالف
    report: "1341094549090471988", // معرف فئة البلاغات
  },

  // نظم التفعيل
  VACtargetChannelId: "1367145654698377366", // اي دي روم فويس تفعيل
  VACRoleid: "1367145484866814083", // رتبة التفعيل
  VACtargettoChannelId: "1367145657500045474", // الروم المطلوب

  // كتالوج التكت
  ticketsCategoryId: "1367145634481836137", // كتالوج التكت
  Shop_CategoryId: "1367145637539217558", // كتالوج التكت
  Alliance_CategoryId: "1367145640152530944", // كتالوج ادارة التحالف

  // رومات السيرفر
  Daily: "1367145731592425503", // روم تقارير اليومية
  Crime: "1367145736864661554", // روم تقارير الاجرام
  Farm: "1367145734335496212", // روم تقارير المزرعة

  // رومات المسح
  sendReports: "1367145729851920469", // ارسال التقارير
  dashboard: "1367145691415183401", // لوحة التحكم البائعين
  highManagement: "1367145740895518782", // لوحة التحكم الادارة
  adminDashboard: "1367145742254215251", // لوحة التحكم العالي
  reviewRequests: "1367145749707493536", // روم مراجعة الطلبات
  reviewvacation: "1367145745677025381", // روم مراجعة الاجازات
  pay_mod: "1367145748361121813", // روم تصحيح تقارير الدفع
  reports_mod: "1367145743772815361", // روم تصحيح تقارير الاعضاء
  applicationsChannel: "1367145753230708906", // روم سجل التفعيل الاعضاء

  channelmazad: "1367195899444465746", // روم المزاد
  imgslogs: "1367145752094314577", // روم سجل الصور
  supch1: "1357189304727769159", // روم التكت 1
  supch1msg1: "1357202309171380307", // رسالة روم ةتكت 1
  supch2: "1357231222157479946", // روم التكت 2
  supch2msg2: "1357231722504257700", // رسالة روم ةتكت 2
  voicetargetChannelId: "1367145617171677215", // روم فويس القران
  allowedGuilds: ["1349061146929532968"],
  botlogs: "1367145750919778424", // سجل البوت
  reportChannel: "1370110410237149305", // لوج البلاغ البائعين
  shop_products: "1367145699057209365", // روم  المنتجات
  shop_submit_seller: "1367145747018944542", // روم تقديم البائعين
  submit_product: "1367145697962623096", // روم تقديم طلب طللبية
  log_feedback_shop: "1367145701838028851", // روم تقيم المتجر
  xp_logs: "1367145674751344640", // روم سجل الاكس بي

  // رتب اساسية
  vacation: "1367145472514461716", // رتبة الاجازة
  seller: "1367145466646761482", //  رتبة الباعئين
  Paid: "1367145471029674146", //  رتبة الدفع
  vandal: "1367145469788033054", //  رتبة الاجرام
  Farmer: "1367145468613758987", //  رتبة المزرعة

  // الحصول علي رتبة
  roles: {
    md_role_shop: "1367145479728664688", // رتبة المتجر
    md_role_family: "1367145480693223565", // رتبة العائلة
    md_role_xp: "1367145481737867304", // رتبة الاكس بي
    md_role_man: "1367145482727460885", // ربة الرجل
    md_role_woman: "1367145483973300386", // رتبة الفتاة
  },

  allmemberrole: "1367145485907001354", // رتبة العضو الجديد

  // رتب العائلة
  topRole: "1367145431724851241", // @・إشراف العائلة
  management: "1367145447436849232", // @・Mangment
  leadManagement: "1367145448200081540", // @・Lead Mangment
  familyManager: "1367145449768751136", // @・Family Manager
  support: "1367145451492479078", // @・Support
  goldFamily: "1367145453765922846", // @・Gold Family
  silverFamily: "1367180421892149328", // @・Silver Family
  bronzeFamily: "1367300747703619654", // @・Bronze Family
  member2: "1367145464264130582", // @・Member 2
  member1: "1367145465669226609", // @・Member 1
  familyrole: "1367145474506887188", // رول العائلة
  TeamFamily: "1367566622889480194", // رول التحلف العامة

  // رتب المسئولين
  rolerequestManager: "1367145436057571328", // مسئول الطلبات
  rolesellerManager: "1367145440532762736", // مسئول البائعين
  PromotionManager: "1367145432630820895", // رتبة مسئول ترقيات
  vacationManager: "1367145436988706827", // رتبة مسئول الاجازات
  reportsManager: "1367145433876402177", // رتبة مسئول التقارير
  AllianceManager: "1367145437840277544", // رتبة مسئول التحالف
  carManager: "1367145443015921695", // رتبة مسئول الكراج
};
